DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
uint32_t fnv1a32(const String& raw) {
  uint32_t hash = 2166136261UL;
  for (size_t i = 0; i < raw.length(); ++i) {
    hash ^= static_cast<uint8_t>(raw[i]);
    hash *= 16777619UL;
  }
  return hash;
}

String hashHex8(const String& raw) {
  String out = String(fnv1a32(raw), HEX);
  while (out.length() < 8) {
    out = "0" + out;
  }
  return out;
}

void appendJSONNullableString(String& out, const String& value) {
  if (value.length() == 0) {
    out += "null";
    return;
  }
  out += "\"";
  out += jsonEscape(value);
  out += "\"";
}

uint8_t clampBrightnessPercent(int value) {
  if (value < kMinBrightnessPercent) {
    return kMinBrightnessPercent;
  }
  if (value > kMaxBrightnessPercent) {
    return kMaxBrightnessPercent;
  }
  return static_cast<uint8_t>(value);
}

void applyDeviceSettings() {
  if (renderer.SupportsBrightnessControl()) {
    renderer.ApplyBrightnessPercent(deviceSettings.brightnessPercent);
  }
}

bool loadDeviceSettings() {
  deviceSettings = DeviceSettings{};
  if (!LittleFS.begin() || !LittleFS.exists(kDeviceSettingsPath)) {
    applyDeviceSettings();
    return false;
  }
  File file = LittleFS.open(kDeviceSettingsPath, "r");
  if (!file) {
    applyDeviceSettings();
    return false;
  }
  const int brightness = file.read();
  file.close();
  if (brightness <= 0) {
    applyDeviceSettings();
    return false;
  }
  deviceSettings.brightnessPercent = clampBrightnessPercent(brightness);
  applyDeviceSettings();
  return true;
}

bool saveDeviceSettings() {
  if (!LittleFS.begin()) {
    return false;
  }
  File file = LittleFS.open(kDeviceSettingsPath, "w");
  if (!file) {
    return false;
  }
  const size_t written = file.write(&deviceSettings.brightnessPercent, 1);
  file.close();
  return written > 0;
}

bool validAuthToken(const String& value) {
  if (value.length() < 16 || value.length() > 64) {
    return false;
  }
  for (size_t i = 0; i < value.length(); ++i) {
    const char c = value.charAt(i);
    const bool ok =
        (c >= 'a' && c <= 'z') ||
        (c >= 'A' && c <= 'Z') ||
        (c >= '0' && c <= '9') ||
        c == '-' ||
        c == '_';
    if (!ok) {
      return false;
    }
  }
  return true;
}

String generateAuthToken() {
  uint32_t seed = ESP.getCycleCount() ^ micros() ^ (static_cast<uint32_t>(ESP.getChipId()) << 8);
  randomSeed(seed);
  String token;
  token.reserve(32);
  for (uint8_t i = 0; i < 4; ++i) {
    uint32_t value = static_cast<uint32_t>(random(0x10000)) << 16;
    value |= static_cast<uint32_t>(random(0x10000));
    char chunk[9];
    snprintf(chunk, sizeof(chunk), "%08lx", static_cast<unsigned long>(value));
    token += chunk;
  }
  return token;
}

bool loadDeviceAuthToken() {
  deviceAuthToken = "";
  if (!LittleFS.begin() || !LittleFS.exists(kDeviceAuthTokenPath)) {
    return false;
  }
  File file = LittleFS.open(kDeviceAuthTokenPath, "r");
  if (!file) {
    return false;
  }
  String token = file.readString();
  file.close();
  token.trim();
  if (!validAuthToken(token)) {
    return false;
  }
  deviceAuthToken = token;
  return true;
}

bool saveDeviceAuthToken(const String& token) {
  if (!validAuthToken(token) || !LittleFS.begin()) {
    return false;
  }
  File file = LittleFS.open(kDeviceAuthTokenPath, "w");
  if (!file) {
    return false;
  }
  file.print(token);
  file.close();
  deviceAuthToken = token;
  return true;
}

bool deviceAuthConfigured() {
  return deviceAuthToken.length() > 0;
}

String requestAuthToken() {
  String token = webServer.header(kDeviceAuthHeader);
  token.trim();
  if (token.length() == 0) {
    token = webServer.arg("token");
    token.trim();
  }
  return token;
}

bool requestHasValidAuth() {
  if (!deviceAuthConfigured()) {
    return true;
  }
  return requestAuthToken() == deviceAuthToken;
}

bool requireWriteAuth() {
  if (requestHasValidAuth()) {
    return true;
  }
  addCorsHeaders();
  webServer.sendHeader("WWW-Authenticate", "VibeTV token");
  webServer.send(401, "text/plain; charset=utf-8", "pairing token required");
  return false;
}

void appendAuthStatusJSON(String& out) {
  out += "\"auth\":{\"paired\":";
  out += deviceAuthConfigured() ? "true" : "false";
  out += ",\"tokenHeader\":\"";
  out += kDeviceAuthHeader;
  out += "\"}";
}

void appendBrightnessCapabilityJSON(String& out) {
  out += "{\"supported\":";
  out += renderer.SupportsBrightnessControl() ? "true" : "false";
  out += "}";
}

void appendSettingsJSON(String& out) {
  out += "\"settings\":{\"display\":{\"brightnessPercent\":";
  out += String(deviceSettings.brightnessPercent);
  out += "}}";
}

void markFirmwareUpdateNoticeDirty() {
  if (!codexbar_display::app::HasFrame(runtimeCtx) ||
      codexbar_display::app::CurrentFrame(runtimeCtx).hasError) {
    return;
  }
  if (!codexbar_display::app::CurrentFrame(runtimeCtx).hasThemeSpec) {
    return;
  }
  if (!runtimeCtx.screenDirty && !waitStatusRendered && !frameStaleStatusRendered) {
    firmwareUpdateNoticeDirty = true;
  } else {
    runtimeCtx.screenDirty = true;
  }
}

bool shouldShowFirmwareUpdateNotice() {
  return firmwareUpdate.available &&
         firmwareUpdate.noticeVisible &&
         !setupMode &&
         !waitStatusRendered &&
         !frameStaleStatusRendered &&
         codexbar_display::app::HasFrame(runtimeCtx) &&
         codexbar_display::app::CurrentFrame(runtimeCtx).hasThemeSpec &&
         !codexbar_display::app::CurrentFrame(runtimeCtx).hasError;
}

const char* currentFirmwareUpdateNoticeText() {
  if (firmwareUpdate.noticePhase >= kFirmwareUpdateNoticeTextCount) {
    firmwareUpdate.noticePhase = 0;
  }
  if (firmwareUpdate.noticePhase == kFirmwareUpdateNoticeAvailablePhase) {
    return "Update available";
  }
  if (firmwareUpdate.noticePhase == kFirmwareUpdateNoticeAppPhase) {
    return kCustomerAppHost;
  }

  const codexbar_display::core::Frame& frame = codexbar_display::app::CurrentFrame(runtimeCtx);
  if (runtimeCtx.topLineOverride.length()) {
    return runtimeCtx.topLineOverride.c_str();
  }
  if (frame.label.length()) {
    return frame.label.c_str();
  }
  if (frame.provider.length()) {
    return frame.provider.c_str();
  }
  return "Provider";
}

