DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
const char* transportCapabilitiesJSON(const char* activeTransport, bool compact = false) {
  const bool isUsb = activeTransport != nullptr && strcmp(activeTransport, "usb") == 0;
  static String json;
  json = "{\"display\":{";
  if (!compact) {
    json += "\"widthPx\":240,\"heightPx\":240,\"colorDepthBits\":16,";
  }
  json += "\"brightness\":";
  appendBrightnessCapabilityJSON(json);
  json += "},\"theme\":";
#ifdef CODEXBAR_DISPLAY_PROBE_ONLY
  json += themeCapabilitiesJSON(false, compact);
#else
#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
  json += themeCapabilitiesJSON(true, compact);
#else
  json += themeCapabilitiesJSON(false, compact);
#endif
#endif
  json += ",";
  appendAuthStatusJSON(json);
  json += ",\"transport\":{\"active\":\"";
  json += isUsb ? "usb" : "wifi";
  json += "\",\"supported\":[\"usb\",\"wifi\"]}}";
  return json.c_str();
}

codexbar_display::app::TransportConfig makeTransportConfig(const char* activeTransport) {
  codexbar_display::app::TransportConfig config;
  config.boardId = CODEXBAR_DISPLAY_BOARD_ID;
  config.firmwareVersion = CODEXBAR_DISPLAY_FW_VERSION;
#ifdef CODEXBAR_DISPLAY_PROBE_ONLY
  config.featuresJSON = "[]";
#else
  config.featuresJSON = kThemeFeatureJSON;
#endif
  config.capabilitiesJSON = transportCapabilitiesJSON(activeTransport);
  config.maxFrameBytes = kMaxFrameBytes;
  return config;
}

String htmlEscape(const String& raw) {
  String escaped;
  escaped.reserve(raw.length());
  for (size_t i = 0; i < raw.length(); ++i) {
    const char c = raw.charAt(i);
    switch (c) {
      case '&':
        escaped += "&amp;";
        break;
      case '<':
        escaped += "&lt;";
        break;
      case '>':
        escaped += "&gt;";
        break;
      case '"':
        escaped += "&quot;";
        break;
      default:
        escaped += c;
        break;
    }
  }
  return escaped;
}

String macInstallerCommand() {
  return F("curl -fsSL https://github.com/DreamyTalesPAN/CodexBar-Display/releases/latest/download/install.sh | bash");
}

String updateTargetURL() {
  return String("http://") + kMdnsHost;
}

String updateInstallCommand() {
  const String target = updateTargetURL();
  String command;
  command.reserve(260);
  command += macInstallerCommand();
  command += F(" -s -- --target ");
  command += target;
  command += F(" && codexbar-display install-update --confirm-live-update --target ");
  command += target;
  return command;
}

String updateStatusHTML(bool compact) {
  String html;
  html.reserve(700);
  if (firmwareUpdate.available) {
    html += compact ? F("<div class='update'>") : F("<section class='update'>");
    html += F("<strong>Firmware update available</strong>");
    html += F("<span>Installed: <code>");
    html += htmlEscape(String(CODEXBAR_DISPLAY_FW_VERSION));
    html += F("</code>");
    if (firmwareUpdate.latestVersion.length() > 0) {
      html += F(" / Latest: <code>");
      html += htmlEscape(firmwareUpdate.latestVersion);
      html += F("</code>");
    }
    html += F("</span><a class='update-link' href='/update'>Install update</a>");
    html += compact ? F("</div>") : F("</section>");
    return html;
  }

  if (!compact) {
    html += F("<section><h2>Firmware status</h2><p class='muted'>Installed: <code>");
    html += htmlEscape(String(CODEXBAR_DISPLAY_FW_VERSION));
    html += F("</code>");
    html += F("<br>Status: <code>");
    html += htmlEscape(firmwareUpdate.lastStatus);
    html += F("</code>");
    if (firmwareUpdate.lastError.length() > 0) {
      html += F("<br>Last check error: <code>");
      html += htmlEscape(firmwareUpdate.lastError);
      html += F("</code>");
    }
    html += F("</p></section>");
  }
  return html;
}

bool readWifiCredentials(WifiCredentials& creds) {
  EEPROM.begin(kEepromBytes);
  uint32_t magic = 0;
  EEPROM.get(0, magic);
  if (magic != kWifiCredsMagic) {
    return false;
  }

  for (size_t i = 0; i < kWifiSsidBytes; ++i) {
    creds.ssid[i] = static_cast<char>(EEPROM.read(4 + i));
  }
  creds.ssid[kWifiSsidBytes - 1] = '\0';
  for (size_t i = 0; i < kWifiPasswordBytes; ++i) {
    creds.password[i] = static_cast<char>(EEPROM.read(4 + kWifiSsidBytes + i));
  }
  creds.password[kWifiPasswordBytes - 1] = '\0';
  return String(creds.ssid).length() > 0;
}

void saveWifiCredentials(const String& ssid, const String& password) {
  EEPROM.begin(kEepromBytes);
  EEPROM.put(0, kWifiCredsMagic);
  for (size_t i = 0; i < kWifiSsidBytes; ++i) {
    EEPROM.write(4 + i, i < ssid.length() ? ssid.charAt(i) : 0);
  }
  for (size_t i = 0; i < kWifiPasswordBytes; ++i) {
    EEPROM.write(4 + kWifiSsidBytes + i, i < password.length() ? password.charAt(i) : 0);
  }
  EEPROM.commit();
}

void clearWifiCredentials() {
  EEPROM.begin(kEepromBytes);
  for (size_t i = 0; i < kWifiCredsBytes; ++i) {
    EEPROM.write(i, 0);
  }
  EEPROM.commit();
  Serial.println("wifi_credentials_cleared");
}

void clearSdkWifiCredentials() {
  WiFi.persistent(true);
  WiFi.mode(WIFI_STA);
  WiFi.disconnect(true);
  delay(150);
  WiFi.persistent(false);
  Serial.println("wifi_sdk_credentials_cleared");
}

uint8_t readBootRecoveryCounter() {
  EEPROM.begin(kEepromBytes);
  uint32_t magic = 0;
  EEPROM.get(kBootRecoveryOffset, magic);
  if (magic != kBootRecoveryMagic) {
    return 0;
  }
  return EEPROM.read(kBootRecoveryCounterOffset);
}

bool readBootRecoveryUploadActive() {
  EEPROM.begin(kEepromBytes);
  uint32_t magic = 0;
  EEPROM.get(kBootRecoveryOffset, magic);
  if (magic != kBootRecoveryMagic) {
    return false;
  }
  return EEPROM.read(kBootRecoveryUploadOffset) == kBootRecoveryUploadMarker;
}

void writeBootRecoveryState(uint8_t counter, bool uploadActive) {
  EEPROM.begin(kEepromBytes);
  EEPROM.put(kBootRecoveryOffset, kBootRecoveryMagic);
  EEPROM.write(kBootRecoveryCounterOffset, counter);
  EEPROM.write(kBootRecoveryUploadOffset, uploadActive ? kBootRecoveryUploadMarker : 0);
  EEPROM.commit();
}

void writeBootRecoveryCounter(uint8_t counter) {
  writeBootRecoveryState(counter, readBootRecoveryUploadActive());
}

