DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
void markBootRecoveryUploadActive(bool active) {
  const bool previous = readBootRecoveryUploadActive();
  if (previous == active) {
    return;
  }
  writeBootRecoveryState(readBootRecoveryCounter(), active);
  Serial.printf("boot_recovery_upload_marker active=%d\n", active ? 1 : 0);
}

void clearBootRecoveryCounter() {
  EEPROM.begin(kEepromBytes);
  for (size_t i = 0; i < kBootRecoveryBytes; ++i) {
    EEPROM.write(kBootRecoveryOffset + i, 0);
  }
  EEPROM.commit();
  bootRecoveryCounterNeedsClear = false;
  Serial.println("boot_recovery_counter_cleared");
}

bool consumeBootRecoveryTrigger() {
  if (readBootRecoveryUploadActive()) {
    clearBootRecoveryCounter();
    Serial.println("boot_recovery_counter_skipped reason=upload_recovery");
    return false;
  }

  uint8_t counter = readBootRecoveryCounter();
  if (counter < 255) {
    ++counter;
  }
  writeBootRecoveryCounter(counter);
  Serial.printf("boot_recovery_counter value=%u threshold=%u\n", counter, kBootRecoveryThreshold);

  if (counter >= kBootRecoveryThreshold) {
    clearWifiCredentials();
    clearSdkWifiCredentials();
    clearBootRecoveryCounter();
    Serial.println("boot_recovery_triggered action=wifi_setup");
    drawWifiResetStatus("Starting setup");
    delay(1000);
    return true;
  }

  bootRecoveryCounterNeedsClear = true;
  bootRecoveryClearAtMs = millis() + kBootRecoveryStableMs;
  return false;
}

bool connectToSavedWifi(const WifiCredentials& creds) {
  Serial.printf("wifi_connect ssid=%s\n", creds.ssid);
  drawWifiConnectingStatus(creds.ssid);
  WiFi.mode(WIFI_STA);
  WiFi.begin(creds.ssid, creds.password);

  const unsigned long startedAt = millis();
  while (WiFi.status() != WL_CONNECTED && (millis() - startedAt) < kWifiConnectTimeoutMs) {
    delay(250);
    Serial.print(".");
  }
  Serial.println();

  if (WiFi.status() != WL_CONNECTED) {
    Serial.printf("wifi_connect_failed status=%d\n", static_cast<int>(WiFi.status()));
    return false;
  }

  Serial.printf("wifi_connected ssid=%s ip=%s\n", creds.ssid, WiFi.localIP().toString().c_str());
  drawWaitingForCompanionStatus();
  return true;
}

bool connectToSdkWifiConfig() {
  WiFi.mode(WIFI_STA);
  const String ssid = WiFi.SSID();
  if (ssid.length() == 0) {
    Serial.println("wifi_sdk_config_missing");
    return false;
  }

  Serial.printf("wifi_sdk_connect ssid=%s\n", ssid.c_str());
  drawWifiConnectingStatus(ssid);
  WiFi.begin();

  const unsigned long startedAt = millis();
  while (WiFi.status() != WL_CONNECTED && (millis() - startedAt) < kWifiConnectTimeoutMs) {
    delay(250);
    Serial.print(".");
  }
  Serial.println();

  if (WiFi.status() != WL_CONNECTED) {
    Serial.printf("wifi_sdk_connect_failed status=%d\n", static_cast<int>(WiFi.status()));
    return false;
  }

  const String password = WiFi.psk();
  if (ssid.length() < kWifiSsidBytes && password.length() < kWifiPasswordBytes) {
    saveWifiCredentials(ssid, password);
    Serial.printf("wifi_sdk_credentials_imported ssid=%s\n", ssid.c_str());
  }

  Serial.printf("wifi_connected source=sdk ssid=%s ip=%s\n", ssid.c_str(), WiFi.localIP().toString().c_str());
  drawWaitingForCompanionStatus();
  return true;
}

void scanSetupNetworks() {
  String options;
  WiFi.mode(WIFI_STA);
  WiFi.disconnect();
  delay(150);
  const int networks = WiFi.scanNetworks();
  for (int i = 0; i < networks; ++i) {
    const String ssid = WiFi.SSID(i);
    if (ssid.length() == 0) {
      continue;
    }
    options += "<option value=\"";
    options += htmlEscape(ssid);
    options += "\">";
    options += htmlEscape(ssid);
    options += " (";
    options += String(WiFi.RSSI(i));
    options += " dBm)</option>";
  }
  WiFi.scanDelete();
  setupWifiOptionsHTML = options;
  Serial.printf("wifi_setup_scan networks=%d options=%u\n", networks, setupWifiOptionsHTML.length());
}

String setupPageHTML() {
  String html;
  html.reserve(1600);
  html += "<!doctype html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'>";
  html += "<title>VibeTV Setup</title><style>";
  html += "body{font-family:-apple-system,BlinkMacSystemFont,Segoe UI,sans-serif;margin:0;background:#101113;color:#f7f7f2}";
  html += "main{max-width:460px;margin:0 auto;padding:32px 20px}label{display:block;margin:18px 0 6px}";
  html += "select,input,button{box-sizing:border-box;width:100%;font:inherit;padding:12px;border-radius:8px;border:1px solid #555;background:#181a1d;color:#fff}";
  html += "button{margin-top:22px;background:#c7ff00;color:#111;border:0;font-weight:700}.muted{color:#aaa;line-height:1.4}";
  html += "</style></head><body><main><h1>VibeTV WiFi</h1>";
  html += "<p class='muted'>Choose your home WiFi and save. Keep your Mac on its normal WiFi. After restart, VibeTV shows the app address for your Mac.</p>";
  html += "<form method='post' action='/save'><label>Choose WiFi</label><select name='ssid'>";
  html += setupWifiOptionsHTML.length() > 0 ? setupWifiOptionsHTML : "<option value=''>No networks found</option>";
  html += "</select><label>Enter SSID manually</label><input name='custom_ssid' maxlength='32' autocomplete='off' placeholder='WiFi name'>";
  html += "<label>Password</label><input name='password' type='password' maxlength='64' autocomplete='current-password'>";
  html += "<button type='submit'>Save</button></form>";
  html += "<p class='muted'>Setup address: http://";
  html += kSetupHost;
  html += "<br>Fallback: http://192.168.4.1</p></main></body></html>";
  return html;
}

String connectedPageHTML() {
  const String ip = WiFi.localIP().toString();
  const bool hasFrame = codexbar_display::app::HasFrame(runtimeCtx);

  String html;
  html.reserve(1500);
  html += F("<!doctype html><meta name=viewport content='width=device-width,initial-scale=1'><title>VibeTV</title><style>");
  html += F("body{font-family:-apple-system,BlinkMacSystemFont,Segoe UI,sans-serif;margin:24px;background:#0b0c0d;color:#f6f4ed}a{color:#c7ff00;font-weight:800}code,pre{background:#08090a;border:1px solid #30343a;padding:8px;display:block;white-space:pre-wrap;word-break:break-word}button,input{width:100%;font:inherit;margin-top:8px}button{padding:12px;background:#c7ff00;border:0;font-weight:900}section{border-top:1px solid #2b2f35;margin-top:16px;padding-top:12px}</style><h1>Vibe TV</h1>");
  html += F("<p>Connected<br><code>http://");
  html += kMdnsHost;
  html += F("</code><code>http://");
  html += ip;
  html += F("</code></p>");
  if (firmwareUpdate.available) {
    html += updateStatusHTML(true);
  }
  if (hasFrame) {
    html += F("<p>Live.</p>");
  } else {
    html += F("<section><h2>Next step</h2><p>Open <a href='");
    html += kCustomerAppUrl;
    html += F("'>");
    html += kCustomerAppHost;
    html += F("</a> on your Mac and follow the main button.</p></section>");
  }
  html += F("<p><a href='/health'>Status</a> <a href='/update'>Update</a></p>");
  const String tokenQuery = deviceAuthConfigured() ? String("?token=") + deviceAuthToken : String();
  if (renderer.SupportsBrightnessControl()) {
    html += F("<section><form method='post' action='/api/settings");
    html += tokenQuery;
    html += F("'><label>Bright</label><input name='b' type='range' min='10' max='100' value='");
    html += String(deviceSettings.brightnessPercent);
    html += F("'><button>OK</button></form></section>");
  }
  html += F("<section><h2>Pairing</h2>");
  if (deviceAuthConfigured()) {
    html += F("<p>Token</p><code>");
    html += htmlEscape(deviceAuthToken);
    html += F("</code><p class='muted'>Use this only when support asks for a pairing token.</p>");
    html += F("<form method='post' action='/api/pair'><button>Rotate token</button></form>");
  } else {
    html += F("<p class='muted'>Create a token before exposing theme controls to other devices on your network.</p>");
    html += F("<form method='post' action='/api/pair'><button>Create token</button></form>");
  }
  html += F("</section>");
  html += F("<form method='post' action='/reset-wifi' onsubmit=\"return confirm('Clear WiFi settings and restart setup?')\"><button>Reset WiFi</button></form>");
  return html;
}

void handleRoot() {
  webServer.keepAlive(false);
  if (setupMode) {
    webServer.send(200, "text/html; charset=utf-8", setupPageHTML());
    return;
  }
  webServer.send(200, "text/html; charset=utf-8", connectedPageHTML());
}

void redirectToSetupRoot() {
  webServer.keepAlive(false);
  webServer.sendHeader("Location", String("http://") + kSetupHost + "/", true);
  webServer.send(302, "text/plain; charset=utf-8", "");
}

