DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
bool readStoredThemeSpec(const String& path, String& raw, String& error) {
  if (!isSafeAssetPath(path) || !path.startsWith("/themes/")) {
    error = "invalid theme path";
    return false;
  }
  if (!LittleFS.begin()) {
    error = "filesystem mount failed";
    return false;
  }
  if (!LittleFS.exists(path)) {
    error = "theme file not found";
    return false;
  }

  File file = LittleFS.open(path, "r");
  if (!file) {
    error = "open theme file failed";
    return false;
  }
  const size_t size = file.size();
  if (size == 0 || size > kMaxStoredThemeSpecBytes) {
    file.close();
    error = "theme file too large";
    return false;
  }
  raw = file.readString();
  file.close();
  raw.trim();
  if (raw.length() == 0 || raw.length() > kMaxStoredThemeSpecBytes) {
    error = "theme file too large";
    return false;
  }
  return true;
}

bool themeSpecMetadata(const String& raw, String& themeId, int& themeRev, String& fallbackTheme, String& error) {
  JsonDocument filter;
  filter["themeId"] = true;
  filter["id"] = true;
  filter["themeRev"] = true;
  filter["rev"] = true;
  filter["fallbackTheme"] = true;
  filter["fb"] = true;

  JsonDocument doc;
  const DeserializationError err = deserializeJson(doc, raw, DeserializationOption::Filter(filter));
  if (err) {
    error = String("bad theme json: ") + err.c_str();
    return false;
  }
  JsonObjectConst spec = doc.as<JsonObjectConst>();
  if (spec.isNull()) {
    error = "theme json must be an object";
    return false;
  }

  const char* id = nullptr;
  if (spec["themeId"].is<const char*>()) {
    id = spec["themeId"].as<const char*>();
  } else if (spec["id"].is<const char*>()) {
    id = spec["id"].as<const char*>();
  }
  if (id != nullptr) {
    themeId = String(id);
    themeId.trim();
  }
  themeRev = static_cast<int>(spec["themeRev"] | spec["rev"] | 0);
  if (themeId.length() == 0 || themeRev <= 0) {
    error = "theme id/rev missing";
    return false;
  }

  const char* fallback = nullptr;
  if (spec["fallbackTheme"].is<const char*>()) {
    fallback = spec["fallbackTheme"].as<const char*>();
  } else if (spec["fb"].is<const char*>()) {
    fallback = spec["fb"].as<const char*>();
  }
  if (fallback != nullptr) {
    String normalized;
    if (codexbar_display::theme::NormalizeThemeName(String(fallback), normalized)) {
      fallbackTheme = normalized;
    }
  }
  return true;
}

void activateStoredThemeSpec(const String& path, const String& raw, const String& themeId, int themeRev, const String& fallbackTheme) {
  renderer.ResetGifStateForAssetUpdate();
  close_all_fs();

  const bool hadFrame = codexbar_display::app::HasFrame(runtimeCtx);
  const codexbar_display::core::Frame previous = runtimeCtx.runtime.current;
  codexbar_display::core::Frame next = hadFrame ? previous : codexbar_display::core::Frame{};

  next.hasError = false;
  next.error = "";
  next.clearThemeSpec = false;
  next.hasThemeSpec = true;
  next.themeSpecId = themeId;
  next.themeSpecRev = themeRev;
  next.themeSpecRaw = "";
  if (fallbackTheme.length() > 0) {
    next.hasTheme = true;
    next.theme = fallbackTheme;
  }

  runtimeCtx.runtime.cachedThemeId = themeId;
  runtimeCtx.runtime.cachedThemeRev = themeRev;
  runtimeCtx.runtime.cachedThemeSpecRaw = raw;
  runtimeCtx.runtime.current = next;
  runtimeCtx.runtime.hasFrame = true;
  runtimeCtx.runtime.resetBaseSecs = next.resetSecs;
  runtimeCtx.runtime.resetBaseMillis = millis();
  activeThemeSpecPath = path;
  activeThemeSpecHash = hashHex8(raw);

  codexbar_display::core::SerialConsumeEvent event;
  event.frameAccepted = true;
  event.hadFrame = hadFrame;
  event.themeSpecChanged = true;
  event.visualChanged = !hadFrame || codexbar_display::core::FrameVisualChanged(previous, next) || event.themeSpecChanged;
  event.themeChanged = hadFrame && codexbar_display::core::FrameThemeChanged(previous, next);
  markFrameAccepted(event, "theme");
}

bool activateStoredThemePath(const String& path, String& themeId, int& themeRev, String& error) {
  String raw;
  if (!readStoredThemeSpec(path, raw, error)) {
    return false;
  }

  String fallbackTheme;
  if (!themeSpecMetadata(raw, themeId, themeRev, fallbackTheme, error)) {
    return false;
  }
  if (!saveActiveThemeSpecPath(path)) {
    error = "save active theme failed";
    return false;
  }

  activateStoredThemeSpec(path, raw, themeId, themeRev, fallbackTheme);
  return true;
}

#endif

void handleThemeActive() {
#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
  if (!requireWriteAuth()) {
    return;
  }
  const bool formMode = webServer.hasArg("path");
  String path = webServer.arg("path");
  if (!formMode) {
    String body = webServer.arg("plain");
    body.trim();
    if (body.length() == 0 || body.length() > 160) {
      addCorsHeaders();
      webServer.send(400, "text/plain; charset=utf-8", "invalid theme activation body");
      return;
    }

    JsonDocument doc;
    const DeserializationError err = deserializeJson(doc, body);
    if (err) {
      addCorsHeaders();
      webServer.send(400, "text/plain; charset=utf-8", "bad theme activation json");
      return;
    }
    path = String(doc["path"] | "");
  }
  path.trim();

  String themeId;
  int themeRev = 0;
  String error;
  if (!activateStoredThemePath(path, themeId, themeRev, error)) {
    addCorsHeaders();
    webServer.send(error == "theme file not found" ? 404 : 400, "text/plain; charset=utf-8", error);
    return;
  }

  if (formMode) {
    webServer.keepAlive(false);
    webServer.sendHeader("Location", "/");
    webServer.send(303);
    return;
  }

  String out;
  out.reserve(160);
  out += "{\"ok\":true,\"path\":\"";
  out += jsonEscape(path);
  out += "\",\"id\":\"";
  out += jsonEscape(themeId);
  out += "\",\"rev\":";
  out += String(themeRev);
  out += ",\"hash\":\"";
  out += jsonEscape(activeThemeSpecHash);
  out += "\"";
  out += "}";
  addCorsHeaders();
  webServer.send(200, "application/json", out);
#else
  addCorsHeaders();
  webServer.send(501, "text/plain; charset=utf-8", "theme spec renderer disabled");
#endif
}

#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
bool loadStoredThemeSpecCacheFromPath(const String& path) {
  String error;
  String raw;
  if (!readStoredThemeSpec(path, raw, error)) {
    Serial.printf("theme_cache_load_failed path=%s err=%s\n", path.c_str(), error.c_str());
    return false;
  }

