DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
  String themeId;
  int themeRev = 0;
  String fallbackTheme;
  if (!themeSpecMetadata(raw, themeId, themeRev, fallbackTheme, error)) {
    Serial.printf("theme_cache_load_failed path=%s err=%s\n", path.c_str(), error.c_str());
    return false;
  }

  runtimeCtx.runtime.cachedThemeId = themeId;
  runtimeCtx.runtime.cachedThemeRev = themeRev;
  runtimeCtx.runtime.cachedThemeSpecRaw = raw;
  activeThemeSpecPath = path;
  activeThemeSpecHash = hashHex8(raw);
  Serial.printf("theme_cache_loaded path=%s id=%s rev=%d\n", path.c_str(), themeId.c_str(), themeRev);
  return true;
}

void loadDefaultStoredThemeSpecCache() {
  String activePath;
  if (readActiveThemeSpecPath(activePath) && loadStoredThemeSpecCacheFromPath(activePath)) {
    return;
  }
  if (loadStoredThemeSpecCacheFromPath(kDefaultThemeSpecPath)) {
    runtimeCtx.runtime.cachedThemeId = kDefaultThemeSpecId;
    runtimeCtx.runtime.cachedThemeRev = kDefaultThemeSpecRev;
  }
}
#endif

String updatePageHTML() {
  const String installCommand = updateInstallCommand();
  const String tokenQuery = deviceAuthConfigured() ? String("?token=") + deviceAuthToken : String();
  String html;
  html.reserve(1600);
  html += F("<!doctype html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'>");
  html += F("<title>VibeTV Update</title><style>");
  html += F(":root{color-scheme:dark}body{font-family:-apple-system,BlinkMacSystemFont,Segoe UI,sans-serif;margin:0;background:#0b0c0d;color:#f6f4ed}main{max-width:620px;margin:auto;padding:24px 18px}a,summary{color:#c7ff00;font-weight:800}h1{margin:16px 0}.muted{color:#a9adb3}.update,input,button,pre{border-radius:8px}.update{border:1px solid #6f8f00;padding:10px}.update-link{display:none}input,button{width:100%;font:inherit;padding:12px;margin-top:10px}button{background:#c7ff00;color:#111;border:0;font-weight:900}pre{white-space:pre-wrap;word-break:break-word;background:#08090a;border:1px solid #30343a;padding:12px}</style></head><body><main>");
  html += F("<h1>VibeTV Update</h1>");
  html += updateStatusHTML(false);
  html += F("<h2>Check with Mac</h2><p class='muted'>Copy this command into Terminal. It refreshes the Mac helper first, then installs firmware if needed.</p><pre id='cmd'>");
  html += htmlEscape(installCommand);
  html += F("</pre><textarea id='cmdFallback' readonly style='position:absolute;left:-9999px'></textarea><button type='button' onclick='copyCmd()' id='copyBtn'>Copy update command</button><details><summary>Manual upload</summary>");
  html += F("<form method='post' action='/update/firmware");
  html += tokenQuery;
  html += F("' enctype='multipart/form-data'>");
  html += F("<input type='file' name='firmware' accept='.bin,application/octet-stream' required>");
  html += F("<button type='submit'>Upload firmware</button></form>");
  html += F("</details>");
  html += F("<p class='muted'><a href='/'>Setup</a> | <a href='/health'>Status</a> | <a href='/assets'>Files</a></p>");
  html += F("<script>function copied(){document.getElementById('copyBtn').textContent='Copied';}function fallbackCopy(t){var a=document.getElementById('cmdFallback');a.value=t;a.focus();a.select();try{document.execCommand('copy');copied();}catch(e){window.prompt('Copy this command',t);}}function copyCmd(){var t=document.getElementById('cmd').textContent.trim();if(navigator.clipboard&&navigator.clipboard.writeText){navigator.clipboard.writeText(t).then(copied,function(){fallbackCopy(t);});}else{fallbackCopy(t);}}</script></main></body></html>");
  return html;
}

void handleUpdatePage() {
  webServer.keepAlive(false);
  webServer.send(200, "text/html; charset=utf-8", updatePageHTML());
}

void setOtaError(const String& message) {
  otaUploadError = message;
  otaDiagnostics.status = "failed";
  otaDiagnostics.lastError = message;
  otaDiagnostics.updateError = Update.getError();
  otaDiagnostics.endedAtMs = millis();
  Serial.printf("ota_error message=%s\n", otaUploadError.c_str());
  if (Update.hasError()) {
    Update.printError(Serial);
  }
}

size_t otaMaxSizeForCommand(int command) {
  if (command == U_FS) {
    return static_cast<size_t>(FS_end - FS_start);
  }
  return static_cast<size_t>((ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000);
}

void enterOtaSafeMode(int command) {
  (void)command;
  firmwareUpdateNoticeDirty = false;
  frameStaleStatusRendered = false;
  renderer.ResetGifStateForAssetUpdate();
  close_all_fs();
  stopMdnsResponder("ota_upload");
  WiFiUDP::stopAll();
  WiFi.setSleepMode(WIFI_NONE_SLEEP);
  ESP.wdtFeed();
}

void handleOtaUpload(int command, const char* target) {
  HTTPUpload& upload = webServer.upload();

  if (upload.status == UPLOAD_FILE_START) {
    otaUploadSucceeded = false;
    otaUploadInProgress = true;
    otaUploadError = "";
    const size_t maxSize = otaMaxSizeForCommand(command);
    otaDiagnostics.target = target;
    otaDiagnostics.status = "starting";
    otaDiagnostics.filename = upload.filename;
    otaDiagnostics.lastError = "";
    otaDiagnostics.command = command;
    otaDiagnostics.contentLength = upload.contentLength;
    otaDiagnostics.totalSize = 0;
    otaDiagnostics.maxSize = maxSize;
    otaDiagnostics.freeSketchSpace = ESP.getFreeSketchSpace();
    otaDiagnostics.updateError = UPDATE_ERROR_OK;
    otaDiagnostics.startedAtMs = millis();
    otaDiagnostics.endedAtMs = 0;
    Serial.printf(
        "ota_upload_start target=%s filename=%s content_length=%zu max_size=%zu free_sketch_space=%zu\n",
        target,
        upload.filename.c_str(),
        upload.contentLength,
        maxSize,
        otaDiagnostics.freeSketchSpace);
    const String targetLabel = command == U_FS ? "Loading display" : "Loading firmware";
    drawUpdateStatus(targetLabel);
    waitStatusRendered = true;
    if (!requestHasValidAuth()) {
      setOtaError("unauthorized");
      return;
    }
    markBootRecoveryUploadActive(true);
    enterOtaSafeMode(command);
    if (!Update.begin(maxSize, command)) {
      setOtaError(Update.getErrorString());
    } else {
      otaDiagnostics.status = "writing";
    }
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    otaDiagnostics.totalSize = upload.totalSize + upload.currentSize;
    if (otaUploadError.length() == 0 && Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
      setOtaError(Update.getErrorString());
    }
    ESP.wdtFeed();
  } else if (upload.status == UPLOAD_FILE_END) {
    otaDiagnostics.totalSize = upload.totalSize;
    if (otaUploadError.length() == 0 && Update.end(true)) {
      otaUploadSucceeded = true;
      otaDiagnostics.status = "succeeded";
      otaDiagnostics.updateError = UPDATE_ERROR_OK;
      otaDiagnostics.endedAtMs = millis();
      otaDiagnostics.successCount++;
      Serial.printf("ota_upload_success target=%s bytes=%zu\n", target, upload.totalSize);
    } else if (otaUploadError.length() == 0) {
      setOtaError(Update.getErrorString());
    }
  } else if (upload.status == UPLOAD_FILE_ABORTED) {
    Update.end();
    setOtaError("upload aborted");
    otaDiagnostics.totalSize = upload.totalSize;
    Serial.printf("ota_upload_aborted target=%s bytes=%zu\n", target, upload.totalSize);
  }
  yield();
}

void scheduleReboot(const char* reason) {
  rebootPending = true;
  rebootAtMs = millis() + kRebootDelayMs;
  Serial.printf("reboot_scheduled reason=%s delay_ms=%lu\n", reason, kRebootDelayMs);
}

